Autodesk.Revit.DB.AnnotationCleanup.ApplyResult(Autodesk.Revit.DB.Document,System.Guid)
Apply annotation cleanup suggestion
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanup.CategoriesToCleanChanged(Autodesk.Revit.DB.Document)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanup.GenerateBitmapForView(Autodesk.Revit.DB.View,System.Boolean)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanup.DumpZoomedBitmap(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element,System.String,Autodesk.Revit.DB.ElementId)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanup.DumpZoomedBitmapsForHosts(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanup.DumpZoomedBitmapsForTagged(Autodesk.Revit.DB.View)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanup.DumpBitmapWithBBoxes(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanup.DumpOverlapBitmap(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanup.DumpCSV(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanup.CleanupAnnotations(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanup
A class providing functionality related to cleaning up annotations in a view.
Since:
2027